petroSym/templates/template_pimpleFoam/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime; // writeNow; 

endTime         1;

deltaT          0.01; // 0.4; //0.05; //1e-04;

writeControl    timeStep; //adjustableRunTime; //

writeInterval   10; // 50;

purgeWrite      2000; //0;

writeFormat     ascii; //binary;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   8;

runTimeModifiable true;

adjustTimeStep  no;

maxCo           10; //2000; // 30; // 20; // 25; // 1; // 25; // 2000; //25; //0.5;

maxDeltaT       100;

functions
{

}

// ************************************************************************* //
