petroSym/templates/template_pimpleFoam/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{	
    p
    {
        solver           GAMG;
        tolerance        1e-8;
        relTol           0.01; // 0.1;
        smoother         GaussSeidel;
        nPreSweeps       0;
        nPostSweeps      1;
        cacheAgglomeration on;
        agglomerator     faceAreaPair;
        nCellsInCoarsestLevel 10;
        mergeLevels      1;
    }

    U
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0.1; //0.1;
    }

    UFinal
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0;
    }
    
    pFinal
    {
        solver           GAMG;
        tolerance        1e-8;
        relTol           0;
        smoother         GaussSeidel;
        nPreSweeps       0;
        nPostSweeps      1;
        cacheAgglomeration on;
        agglomerator     faceAreaPair;
        nCellsInCoarsestLevel 10;
        mergeLevels      1;
    }


    k
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0.1; //0.1;
    }

    epsilon
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0.1; //0.1;
    }

    kFinal
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0.1; //0.1;
    }

    epsilonFinal
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0.1; //0.1;
    }


    omega
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0.1; //0.1;
    }

    omegaFinal
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0.1; //0.1;
    }

    nuTilda
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        nSweeps         2;
        tolerance       1e-08;
        relTol          0.001;
    }

    nuTildaFinal
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        nSweeps         2;
        tolerance       1e-08;
        relTol          0.001;
    }

    Phi
    {
    solver GAMG;
    smoother GaussSeidel;
    cacheAgglomeration no;
    agglomerator faceAreaPair;
    nCellsInCoarsestLevel 10;
    mergeLevels 1;
    nPreSweeps 0;
    nPostSweeps 1;
    tolerance 1e-08;
    relTol 0.01;
    }

}

PIMPLE
{
    momentumPredictor yes; //no;
    nOuterCorrectors 1;
    nCorrectors     4; //2;
    nNonOrthogonalCorrectors 2; //0;
    pRefCell        0;
    pRefValue       0;
}

SIMPLE
{
    nNonOrthogonalCorrectors 2;
    pRefCell        0;
    pRefValue       0;

    residualControl
    {
        p               1e-5;
        U               1e-5;
        nuTilda         1e-5;
    }
}



relaxationFactors
{
    fields
    {
	p_rgh	0.15;
    }
    equations
    {
        U               0.35; // 0.8;
        k               0.4; //0.7;
        epsilon         0.4; //0.7;
        R               0.7;
        nuTilda         0.7;
    }
}

potentialFlow
{
    nNonOrthogonalCorrectors 10;
    PhiRefCell 0; 
    PhiRefValue 0;
}
// ************************************************************************* //
